app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "extension", "titulo", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 13 Jan 2013 13:17:49 UTC +00:00], ["extension", "jpg"], ["titulo", "tuna"], ["updated_at", Sun, 13 Jan 2013 13:17:49 UTC +00:00], ["usuario_id", 1]]
---
  def create
    @post = Post.new(params[:post])
    @post.usuario_id = current_user.id
    respond_to do |format|
      if @post.save