app/controllers/relationships_controller.rb

  def create
    @usuario = Usuario.find(params[:relationship][:followed_id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @usuario = Relationship.find(params[:id]).followed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "1"]]