app/controllers/usuarios_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
    @posts = Post.where(:usuario_id => @usuario.id)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."usuario_id" = 1

  def create
    @usuario = Usuario.new(params[:usuario])
    datos = params[:usuario].to_hash
    if @usuario.save
---
INSERT INTO "usuarios" ("admin", "created_at", "crypted_password", "email", "salt", "sexo", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "usuarios" SET "username" = 'dani', "email" = 'dani@dani.es', "salt" = 'rpeSCLzBtMvku4Mf27WB', "crypted_password" = '$2a$10$ufp2ellh1uH2aWrpbUTGJ.lSdJsKxT1/Fcnvq6CTJ2gB2xYfDKqUK', "updated_at" = '2013-01-13 15:16:41.327378' WHERE "usuarios"."id" = 2

  def following
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "2"]]

  def followers
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]